questions = [
    {
        "question": "Какое время суток вам больше всего нравится?",
        "options": ["Утро", "День", "Вечер", "Ночь"],
        "key": "time_of_day",
        "scores": {"a": 1, "б": 1, "в": 1, "г": 1}
    },

    {
        "question": "Какую стихию вы предпочитаете?",
        "options": ["Земля", "Вода", "Огонь", "Воздух"],
        "key": "element",
        "scores": {"a": 1, "б": 1, "в": 1, "г": 1}
    },

    {
        "question": "Какое качество вы цените в людях больше всего?",
        "options": ["Мудрость", "Доброта", "Смелость", "Творчество"],
        "key": "quality",
        "scores": {"a": 1, "б": 1, "в": 1, "г": 1}
    },

    {
        "question": "В каком ландшафте вы чувствуете себя наиболее комфортно?",
        "options": ["Лес", "Горы", "Побережье", "Пустыня"],
        "key": "landscape",
        "scores": {"a": 1, "б": 1, "в": 1, "г": 1}
    },

    {
        "question": "Какой тип деятельности вас больше всего привлекает?",
        "options": ["Исследования и обучение", "Общение и помощь другим",
                    "Приключения и путешествия", "Творчество и искусство"],
        "key": "activity",
        "scores": {"a": 1, "б": 1, "в": 1, "г": 1}
    },

    {
        "question": "Как вы предпочитаете проводить свободное время?",
        "options": ["В одиночестве, занимаясь любимым делом", "В компании друзей",
                    "На природе", "Путешествуя или изучая что то новое"],
        "key": "free_time",
        "scores": {"a": 1, "б": 1, "в": 1, "г": 1}
    },
]

results = {
    "a": {
        "text": "Лось - символ мудрости, знаний и устойчивости.",
        "image": "Картинки/Лось.jpg"
    },
    "б": {
        "text": "Дельфин - символ доброты, гармонии и связи с водной стихией.",
        "image": "Картинки/Дельфин.jpg"
    },
    "в": {
        "text": "Орел - символ смелости, острого зрения и высоты целей.",
        "image": "Картинки/Орел.jpg"
    },
    "г": {
        "text": "Лисица - символ творчества, адаптивности и хитрости.",
        "image": "Картинки/Лисица.jpg"
    },
    "equal": {
        "text": "Медведь - символ универсальности, силы и мудрости.",
        "image": "Картинки/Медведь.jpg"
    }
}
